// Переменные и типы данных

/*
Для объявления переменных используется:
*/
var foo = 1; // foo - имя, 1 - значение

/*
Для удаление переменной используется:
*/
delete foo;

/*
В js используется 6 примитивных типов данных:
*/
var foo = 1; // Целые
var foo = 1.5; // Дробные
var foo = 'bar'; // Строки
var foo = true; // и false; Логические
var foo = null; // NULL
var foo = undefined; // Неопределено

/*
И 3 составных
*/
var foo = [1,2,3]; // Массивы
var foo = {bar: 'baz'}; // Словари/объекты
var foo = function(a, b){ // Функции
  return a + b;
}
