/*
Для вывода данных в консоль, используется:
*/
console.log('Hello world');

/*
Установи себе nodejs по этой инструкции https://nodejs.org/en/download/
и выполни в консоли команду: node 1/3.js
*/

var chipsogriz = "Чипсил, чипсил, да не вычипсил";
// Удали этот коммент и напиши вместо него команду для вывода в консоль 
// переменной chipsogriz

// Под этим комментом объяви по одной переменной и инициализируй их каждым из 6 
// примитивных типов данных:

// А тут объяви 3 переменные и инициализируй их каждым из 3 составных типов 
// данны:
