/*
Операции над данными
*/

// Целые и дробные
console.log(5 + 2.5 - 1 * 4.2 / 2); // сложение, вычитание, умножение, деление
console.log(5 % 2); // остаток от деления
console.log(5 > 2); // больше
console.log(5 < 2); // меньше
console.log(5 >= 2); // больше или равно
console.log(5 <= 2); // меньше или равно
console.log(5 == 2); // равно по значению
console.log(5 != 2); // не равно по значению
console.log(5 === 2); // равно по значению и типу
console.log(5 !== 2); // не равно по значению и типу

// Строки
console.log('Hello' + ' ' + 'world'); // Конкатенация

// Логические
console.log(true && true); // И
console.log(true || false); // ИЛИ
console.log(!true); // НЕ

// Выполни этот файл, епта
